[
{
    "id": 1,
    "title": "Weekend T-Shirt",
    "details": [
        "This comfy cotton T-shirt is your weekend uniform with slouchy dropped shoulders and a perfectly boxy fit.",
        "24\" length (size Medium)",
        "91% cotton, 9% polyester",
        "Machine wash, dry flat",
        "Imported",
        "Item #5948347"
    ],
    "rating_div": {
        "5": 61,
        "4": 19,
        "3": 10,
        "2": 6,
        "1": 4
    },
    "image": "https://n.nordstrommedia.com/id/sr3/a5103eb6-c432-4bc1-a67b-20c348630667.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Boxy Tee Goals",
            "body": "I love this tee! Perfect boxy fit. Not super see-through but have not tried it on with a black bra yet for the ultimate test. The sleeve length is great. Can tuck in the front for a cute look.",
            "date": "Apr 28, 2020"
        },
        {
            "heading": "perfect",
            "body": "The perfect oversized tee you can wear it casually or dress it up",
            "date": "July 23, 2020"
        },
        {
            "heading": "Runs large",
            "body": "I own the white color and this is much longer for some reason",
            "date": "July 23, 2020"
        },
        {
            "heading": "Great every day tee",
            "body": "I bought this for my 20 something daughter,and she loved it.",
            "date": "July 22, 2020"
        },
        {
            "heading": "Kinda flimsy",
            "body": "While I like the shape of this T-shirt, I found it much lighter in weight than the other with the raglan sleeve, that I bought. The fabric seems a little flimsy, and the T-shirt is purposely unfinished at the bottom. It was just ok, but at this price, I’m going to keep it. I don’t recommend this unless you want a very lightweight T-shirt.",
            "date": "July 21, 2020"
        },
        {
            "heading": "Not a fan.",
            "body": "This tee is very boxy and very short. The medium fit like an extra large.",
            "date": "July 16, 2020"
        },
        {
            "heading": "Really Great Basic Tee",
            "body": "Excellent basic tee, goes great with jeans, shorts, anything.",
            "date": "July 15, 2020"
        },
        {
            "heading": "Not flattering",
            "body": "This shirt is not flattering. It's boxy, so if that is the look you're going for then it's good. I have a bigger chest and it just doesn't lay nicely, and makes me look very large. It may be ok for a loungy shirt or pajamas.",
            "date": "July 9, 2020"
        },
        {
            "heading": "Love this t-shirt",
            "body": "Great t-shirt. I wish there was more colors. Vey comfortable material and fit. True to size, I am a small and it fits perfect. Much cuter on then the pictures online.",
            "date": "July 8, 2020"
        },
        {
            "heading": "Nice Basic Tee",
            "body": "Good quality, nice fit but boxy so definitely for certain types of bodies only. Found it more flattering with a French tuck tho!",
            "date": "July 8, 2020"
        }
    ]
},
{
    "id": 2,
    "title": "Whisper Cotton Ribbed Crewneck T-Shirt",
    "details": [
        "The secret's out: Madewell has updated the crewneck on their best-selling T-shirt for even more vintage vibes. Fashioned of light and airy slub cotton, this T-shirt is live-in-it soft and perfectly draped—one to tell your friends about, in other words.",
        "26\" length (size Medium)",
        "Crewneck",
        "Short sleeves",
        "Curved hem",
        "100% cotton",
        "Machine wash, tumble dry",
        "Imported",
        "t.b.d.",
        "Item #5944408"
    ],
    "rating_div": {
        "5": 63,
        "4": 15,
        "3": 6,
        "2": 7,
        "1": 9
    },
    "image": "https://n.nordstrommedia.com/id/sr3/965ca924-3d01-4240-a196-1b000d939869.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Very disappointed",
            "body": "This T-shirt started to get holes in it after wearing it one time at home. Didn’t even wash it once yet.",
            "date": "May 21, 2020"
        },
        {
            "heading": "Disappointed",
            "body": "I was excited about the shirt because of the price and good reviews, and I know it's just a basic shirt, but it's very thin, kinda baggy. I haven't had it a week, and there's a hole by the neck, and lots of string hanging of the sleeve",
            "date": "May 8, 2020"
        },
        {
            "heading": "madewell cotton ribbed tee shirt",
            "body": "Ive ordered this brand in the past and thought these were the same but they weren't. They are short for a tee shirt and boxy. Not flattering at all. The fabric for cotton is rough and scratchy. all 3 going back.",
            "date": "July 25, 2020"
        },
        {
            "heading": "cute fit, bad quality",
            "body": "I was excited about this tee. The fit is great and I love the rib detailing. However, after one wash the shirt had multiple holes in it.",
            "date": "July 11, 2020"
        },
        {
            "heading": "Great T-shirt",
            "body": "Love the neckline. I usually don’t love higher neck line but this one is good. Tshirt I ordered large. I have large chest . 5’8” fit . I wear with high rise jeans or Lululemons and tie at bottom. I bought the white one and the grey one . Part of my summer Covid uniform lol.",
            "date": "July 9, 2020"
        },
        {
            "heading": "Traditional tee",
            "body": "Great, very standard tee. No stand out details. Whisper cotton is thin, but (the black tee) not sheer. Good fit and drape. My daughter, 5’7”, likes the fit to be ever so slightly big, so she got a medium.",
            "date": "July 8, 2020"
        },
        {
            "heading": "Thin and flimsy",
            "body": "The quality of the material in my opinion was not great. Thin & Flimsy.",
            "date": "July 5, 2020"
        },
        {
            "heading": "Good shirt",
            "body": "It's a nice comfortable shirt, but runs a little large for my preference (for reference I'm 5'3 and ~120lbs, ordered a small)",
            "date": "July 1, 2020"
        },
        {
            "heading": "soft and looks great",
            "body": "Perfect T. Fabric is good weight (not see through and not heavy), fits great.",
            "date": "June 27, 2020"
        },
        {
            "heading": "Perfect Basic Tee",
            "body": "I am 5'4 and 180lbs and a bit curvy. I usually am an L/XL on shirts so I went with a L white. This is a nice loose fit and the L was perfect with almost a baggy for to it. I have read reviews on ripping so I will make sure to keep an eye on it when I wash and dry it. This can easily be dressed up and down! Would love to get the other colors as well",
            "date": "June 21, 2020"
        }
    ]
},
{
    "id": 3,
    "title": "Ringer V-Neck T-Shirt",
    "details": [
        "Ringer styling gives this heathered T-shirt a sporty, retro vibe.",
        "25\" length (size Medium)",
        "V-neck",
        "Short sleeves",
        "50% polyester, 50% rayon",
        "Machine wash, tumble dry",
        "Imported",
        "t.b.d.",
        "Item #6042346"
    ],
    "rating_div": {
        "5": 100,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "image": "https://n.nordstrommedia.com/id/sr3/af8d9e1d-2736-43f2-93ca-12122dbbf4c8.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 4,
    "title": "Whisper Cotton V-Neck Pocket Tee",
    "details": [
        "A classic pocket tee with a deep V-neckline is spun from soft, lightweight slub cotton in a spectrum of colors that add punch to your everyday wardrobe.",
        "25 1/2\" regular length (size Medium); 27 1/2\" plus length (size 1X)",
        "V-neck",
        "Short sleeves",
        "Side slits",
        "100% cotton",
        "Machine wash, tumble dry",
        "Imported",
        "t.b.d.",
        "Item #5399848"
    ],
    "rating_div": {
        "5": 65,
        "4": 16,
        "3": 9,
        "2": 5,
        "1": 5
    },
    "image": "https://n.nordstrommedia.com/id/sr3/dbe2f599-30bd-4d8d-8533-fe70e34f23d4.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Holes within hours",
            "body": "I’ve had several Madewell tees over the years and wanted to update my collection with newer ones. I wore it for the first time today and within hours the bottom of the shirt had four different holes in various spots. This was the white tee so I’m wondering if there is something defective with this particular color as others have had the same issue. Very disappointed! I’ll be returning this one and may give a different color a try. These are perfect for me as I’m a mom to three young children so I’m hopeful it will work out.",
            "date": "June 20, 2020"
        },
        {
            "heading": "Don't waste your money!",
            "body": "I bought 2 of the v-neck t-shirt in white. The 1st time I noticed a hole after washing, I was pretty disappointed. So I bought it again the 2nd time and after 1st wash the shirt has holes again! Don't waste your money and avoid buying this shirt especially in white. This should be 0 star!",
            "date": "June 4, 2020"
        },
        {
            "heading": "nice T-shirt, but already worn out and holey",
            "body": "I bought 2 of these t-shirts in gray and black and not even 3 months later I need to replace them as they both have multiple holes and are losing their shape. Disappointed!",
            "date": "Apr 19, 2020"
        },
        {
            "heading": "mominquaratine",
            "body": "Cheap material. Bought white and black tees after two wears several large holes in front.",
            "date": "Apr 13, 2020"
        },
        {
            "heading": "cute but flimsy",
            "body": "I love the shape and feel of these tanks and tees, however I have had 2 tanks and 1 tee to date. All 3 have ended up with holes in them after very few washes and wears. The hole in the tee in by the pocket and the tanks are on the shoulders. I wash according to instructions but have not had any luck after trying 3. So sad to have to give them away or possibly return.",
            "date": "Apr 7, 2020"
        },
        {
            "heading": "Cheaply Made",
            "body": "I was so excited about this t-shirt when I saw all the colors at Nordstrom. Unfortunately about a month after purchasing the shirt in white, there is a hole near the pocket. A quality shirt should not do this. I had washed in delicates and hung dry it each time.",
            "date": "June 1, 2016"
        },
        {
            "heading": "made well",
            "body": "I Always go to my Madewell T-shirts fit perfect true to size",
            "date": "July 25, 2020"
        },
        {
            "heading": "Comfy!",
            "body": "I ordered a small, but I usually wear medium. It fits better when you size down. The color is very pretty and great for summer.",
            "date": "July 23, 2020"
        },
        {
            "heading": "perfect",
            "body": "The perfect white tee. Not much more to say than that. I have purchased this shirt over and over. I like my T-shirts a little loose so I order a size up.",
            "date": "July 19, 2020"
        },
        {
            "heading": "order down",
            "body": "I normally wear a petite xs but this garment runs large. I reordered them in an xxs and was very pleased with the way they fit. They are lightweight.",
            "date": "July 15, 2020"
        }
    ]
},
{
    "id": 5,
    "title": "Favorite Daughter Tee",
    "details": [
        "Whether your tween is an only daughter, or one of many, she'll know she's a favorite with this graphic tee."
    ],
    "rating_div": {},
    "image": "https://n.nordstrommedia.com/id/sr3/6e7ee308-fba0-475d-96aa-342f7aa9b716.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 6,
    "title": "Pointelle Top",
    "details": [
        "Dainty pointelle stitching creates tiny perforations in this lightweight V-neck top.",
        "24 1/2\" front length; 27\" back length (size Medium)",
        "V-neck",
        "Long sleeves",
        "62% polyester, 34% rayon, 4% elastane",
        "Hand wash, dry flat",
        "Made in the USA",
        "BP.",
        "Item #5993726"
    ],
    "rating_div": {
        "5": 60,
        "4": 0,
        "3": 20,
        "2": 20,
        "1": 0
    },
    "image": "https://n.nordstrommedia.com/id/sr3/05f92cb0-81a0-4707-9f0e-3049a306e7d7.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 7,
    "title": "Raglan Crop T-Shirt",
    "details": [
        "Raw edges bring boxing gym vibes to this cropped top that pulls no punches when it comes to cool street style.",
        "20\" length (size 8 US (fits like 6-8))",
        "Crewneck",
        "Short sleeves",
        "100% cotton or 91% cotton, 9% polyester",
        "Machine wash, dry flat",
        "Imported",
        "Item #6029804"
    ],
    "rating_div": {
        "5": 66,
        "4": 11,
        "3": 13,
        "2": 4,
        "1": 6
    },
    "image": "https://n.nordstrommedia.com/id/sr3/4558db3e-9ba4-4f28-8b26-98fb0c5c278a.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Great Crop Top!",
            "body": "Love this. Affordable, the perfect length, and true to size.",
            "date": "May 19, 2020"
        },
        {
            "heading": "A bit larger than expected",
            "body": "This T-shirt is beefy and runs a bit larger than I’d expect, but I like it and am keeping it, due to the price. I have a favorite T-shirt brand that I’ll buy from, from now forward. I’m a size 8-10 and I bought a 10. I should have ordered an 8, but that’s ok.",
            "date": "July 21, 2020"
        },
        {
            "heading": "staple in your closet",
            "body": "Really cute shirt. Runs a little small, go up one size. Thinking about getting more colors. Good price",
            "date": "July 15, 2020"
        },
        {
            "heading": "comfy :)",
            "body": "Super comfy and causal",
            "date": "July 10, 2020"
        },
        {
            "heading": "Bought Three (so far)",
            "body": "So I've bought three of these shirts so far. That's how much I love it. It's a great casual crop top. Sizing recommendation is right on. The price is right, so go for it!",
            "date": "July 8, 2020"
        },
        {
            "heading": "Cute and easy",
            "body": "Easy light little crop to run around in. Nice quality too.",
            "date": "July 7, 2020"
        },
        {
            "heading": "Nice",
            "body": "True to color and size (roomy). I like that it's short, but not to show skin. Great for jeans and casual wear. I just found its not as soft as t-shirt material. I hope it softens with each wash, but I'll keep it.",
            "date": "July 6, 2020"
        },
        {
            "heading": "Love this find!",
            "body": "Super cute top. Cotton too!! Once it’s washed the raw cut edges on the arms sleeves and the bottom roll up a little which is super cute!im 5’2” 107 lbs and either the 2 or 4 fit",
            "date": "June 25, 2020"
        },
        {
            "heading": "Loved at First",
            "body": "I was obsessed with this shirt at first and ordered multiple colors but then it shrunk, even when I air dried it. I would size up for that fact. It’s also not the softest material but for the price point (purchased on sale for $10.50) I didn’t expect anything more.",
            "date": "June 18, 2020"
        },
        {
            "heading": "Top and espadril sandals",
            "body": "Top arrived early and sandals Arrived on delivery date given items were beautifly packed and shipped in good condition This is my first time ordering online from Nordstrom good quality merchandise and nice packaging nicely shipped",
            "date": "June 13, 2020"
        }
    ]
},
{
    "id": 8,
    "title": "Rounded V-Neck T-Shirt",
    "details": [
        "A gently rounded V-neckline, short sleeves and chest pocket style a lightweight slub-knit T-shirt that's available in a multitude of colors.",
        "26\" length (size Medium)",
        "V-neck",
        "Short sleeves",
        "Semi-sheer",
        "60% cotton, 40% modal",
        "Machine wash, dry flat",
        "Imported",
        "Item #1138832_11"
    ],
    "rating_div": {
        "5": 76,
        "4": 28,
        "3": 13,
        "2": 8,
        "1": 7
    },
    "image": "https://n.nordstrommedia.com/id/sr3/bb97d0c4-40f1-4923-bd36-1b2cb2bf5540.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "soft and breathable",
            "body": "This simple tee is so soft and versatile. Pair with jeans or shorts. I love the rounded neck because it gives the tee a little something Vs a regular neck.",
            "date": "July 13, 2020"
        },
        {
            "heading": "Love! Love! Love!",
            "body": "I’m a mom. I have this shirt in 4-5 colors and have 2 of some colors. This shirt is loose, long enough to be tucked into the front if needed and comfy. Washes well and packs well. I have one shirt that has gotten a hole in it which I assume is from multiple wears and one shirt is very thin also from multiple washes. I’m 5’1 123lbs. Usually wear a Sm/Med and I order a Xs in this shirt.",
            "date": "May 22, 2020"
        },
        {
            "heading": "Little holes",
            "body": "I picked up a couple of these shirts last month. After a few washes and normal wear, one has a little hole right above the waistline, like several other reviewers. It’s loose firing and I’m sitting at my desk most of the day, so I’m pretty disappointed. I paid full price for a shirt that lasted a month. I won’t be buying anymore of these.",
            "date": "Apr 3, 2020"
        },
        {
            "heading": "loved the color",
            "body": "Gorgeous color and the fabric is a bit thin, but fine for Las Vegas weather. I received this and immigration put it on. After a few hours of wear (with jeans) it has little holes at the bottom (see pic) i can only assume from the jeans button. This hasn’t happened to me before so not sure what is going on. I will be keeping it as i love the color. Purchased size XS - i am 5’6” and 135lb",
            "date": "Apr 1, 2020"
        },
        {
            "heading": "little holes after one wear",
            "body": "I loved this shirt and was so excited to wear it! After just one wear and washing in delicate and hang drying, there were little holes along the waist. Nordstrom-made brands used to be high-quality and long-lasting. Nordstrom, please go back to making clothes that last. Please don’t continue to make fast fashion quality clothes.",
            "date": "July 21, 2020"
        },
        {
            "heading": "Great staple",
            "body": "Love this tee-shirt. I have a large bust and this tee-shirt does not make me look fat which is great. Very flattering. I bought multiples.",
            "date": "July 6, 2020"
        },
        {
            "heading": "Returned didn't like",
            "body": "I love Caslon and have several of their tops. This, as another review stated, was thin and scratchy.",
            "date": "July 1, 2020"
        },
        {
            "heading": "small holes after a few months",
            "body": "Was a great shirt for the first few months. Tiny holes appeared after a dozen or so wears",
            "date": "June 30, 2020"
        },
        {
            "heading": "Comfy tee",
            "body": "This tee is so comfortable. You can wear it around the house, on errands, or pair it with a necklace for casual outing. I am 5’0, 133 lbs, and bought a small. It fits well.",
            "date": "June 27, 2020"
        },
        {
            "heading": "Fave shirt",
            "body": "I was so excited abt this short. Fits great. I lo e the fit and color. Great purchase, especially on sale!",
            "date": "June 25, 2020"
        }
    ]
},
{
    "id": 9,
    "title": "Miler Dri-FIT Running T-Shirt",
    "details": [
        "Ventilated, sweat-wicking fabric and a mesh back panel keep up with you at any intensity and any distance in a comfortable running T-shirt. Reflective trim along the shoulders, chest and back ensure that you are visible in low-light conditions.",
        "26\" front length; 29\" back length (size Medium)",
        "Crewneck",
        "Back mesh panel",
        "Dropped back hem keeps you covered as you move",
        "Reflective details enhance visibility in low light or at night",
        "Nike Breathe fabric helps you stay dry and cool",
        "Dri-FIT moisture-wicking technology",
        "100% polyester",
        "Machine wash, tumble dry",
        "Imported",
        "Item #5957588"
    ],
    "rating_div": {
        "5": 33,
        "4": 0,
        "3": 0,
        "2": 67,
        "1": 0
    },
    "image": "https://n.nordstrommedia.com/id/sr3/e028bf11-c7b0-49c0-a670-70e41cbf41cd.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 10,
    "title": "Studded V-Neck Cotton Blend T-Shirt",
    "details": [
        "Polished studs edge the V-neck of a versatile T-shirt cut from a soft cotton blend.",
        "24 1/2\" length (size M)",
        "V-neck",
        "Short sleeves",
        "60% cotton, 40% modal",
        "Machine wash, tumble dry",
        "Imported",
        "Point of View",
        "Item #5944415"
    ],
    "rating_div": {
        "5": 43,
        "4": 24,
        "3": 11,
        "2": 11,
        "1": 11
    },
    "image": "https://n.nordstrommedia.com/id/sr3/7e014f9f-83b0-4e15-865b-2abe2f0bf7a3.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Cute Top",
            "body": "Cute, comfortable black top. The grommets really add to it so it’s not just a plain black tee.",
            "date": "July 18, 2020"
        },
        {
            "heading": "Very comfortable cotton, fits well",
            "body": "Soft Cotton, fits nicely, true to size",
            "date": "July 14, 2020"
        },
        {
            "heading": "great v neck shirt with studs around neck line.",
            "body": "This shirt is soft and looks great. I wear it with some khaki shorts.",
            "date": "July 12, 2020"
        },
        {
            "heading": "runs small",
            "body": "Good value since it was bought on sale. Nice fit but runs small",
            "date": "July 11, 2020"
        },
        {
            "heading": "Nice casual shirt",
            "body": "Soft, comfortable material. Great casual shirt for summer. Relaxed fit.",
            "date": "July 10, 2020"
        },
        {
            "heading": "excellent choice",
            "body": "Love the t-shirt. Excellent quality material.",
            "date": "July 10, 2020"
        },
        {
            "heading": "Bumped my T-shirt wardrobe up a notch!",
            "body": "I am 5'4\", wear size 4-6 and the Small fits perfect, not too loose and not too tight. I bought this in Black, Blue Cloud, and Caviar Heather. They look incredibly cute and feel great! After reading the reviews, I plan to be careful with washing and throw them in a lingerie bag so they last a long time. Actually, I would do that anyway with the detailed neckline, so no biggie. Finding them at a great sale price was an added bonus!! Thank you Nordstrom:)",
            "date": "July 5, 2020"
        },
        {
            "heading": "terrible shirt",
            "body": "Bought this in gray last fall. It looked so cute in the pic. It is short and boxy. It doesn’t hang nice and the fabric is very cheep. I’ve had better quality at Target. It shrunk about an inch when it was washed. Don’t bother buying this.",
            "date": "June 29, 2020"
        },
        {
            "heading": "Nice tee shirt",
            "body": "It runs little big, the material is thinner than I thought it would be. I got it on sale, a good price! The color is a very light gray..I like it!",
            "date": "June 29, 2020"
        },
        {
            "heading": "Not impressed",
            "body": "Just wasn’t what I was expecting. I got the tuberose color. Meh. Maybe black would have been better.",
            "date": "June 28, 2020"
        }
    ]
},
{
    "id": 11,
    "title": "Studio Tee",
    "details": [
        "Strike your best pose in this yoga-perfect tee, made from breathable cotton with a high/low hem that covers all the right areas.",
        "23 1/2\" front length; 26 1/2\" back length (size Medium)",
        "Crewneck",
        "Short sleeves",
        "100% cotton",
        "Machine wash, tumble dry",
        "Imported",
        "Women's Active & Swim",
        "Item #5903566"
    ],
    "rating_div": {
        "5": 50,
        "4": 13,
        "3": 25,
        "2": 13,
        "1": 0
    },
    "image": "https://n.nordstrommedia.com/id/sr3/300c132d-7284-4cc6-a3f1-e6db4afaed81.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Runs small!",
            "body": "Quality is good but a 3X runs like a 1x to 2x. I like a loose fit for a work out shirt. Returning.",
            "date": "July 25, 2020"
        },
        {
            "heading": "Not your average T-shirt",
            "body": "Love Zella! This T-shirt does not disappoint. Fun print, comfortable but not boxy fit & quality material. Perfect summer T-shirt when you want to dress up your workout.",
            "date": "July 18, 2020"
        },
        {
            "heading": "Get this!",
            "body": "I went in and tried on the red tie dye & it’s so cute! The blue is also really pretty! I am normally a large in Zella’s shirts and that’s what I got and it’s perfect. It’s definitely a shirt for running errands in rather than working out in. Would love to get the blue.",
            "date": "July 18, 2020"
        },
        {
            "heading": "Zella Studio Tee: Tip Top",
            "body": "Love these tees for yoga, to layer, mix and match under my Zella turtlenecks, Carter hoodies, and Karly tees for more warmth. They will also be good in the summer alone. Good weight cotton fabric, roomy fit on top, not clingy for movement. Love the longer length in the back, great with leggings. Glad I was able to snag teal, light blue and black on sale. These work year round at home and on the go.",
            "date": "Jan 24, 2020"
        },
        {
            "heading": "basic t shirt",
            "body": "This shirt is definitely boxy in style, so order size accordingly. I liked the colors online more than in person but my true disappointment is the fabric. It’s a casual cotton shirt better suited for running errands that working out. Had I read the fabric before purchase I would’ve realized this but assumed since it’s Zella it’s an active wear material.",
            "date": "Dec 11, 2019"
        }
    ]
},
{
    "id": 12,
    "title": "Ava T-Shirt",
    "details": [
        "Flattering and functional, this T-shirt is a staple for any activity in soft, stretchy fabric with a longer back hem for extra coverage.",
        "24\" front length; 26\" back length (size Medium)",
        "V-neck",
        "Short sleeves",
        "74% polyester, 18% lyocell, 8% spandex",
        "Machine wash, tumble dry",
        "Imported",
        "Women's Active & Swim",
        "This garment was made in a factory that supports women worker empowerment through HERproject, which creates partnerships to enable workplace-based interventions on health, financial inclusion and gender equality",
        "Item #5413245"
    ],
    "rating_div": {
        "5": 71,
        "4": 17,
        "3": 7,
        "2": 4,
        "1": 1
    },
    "image": "https://n.nordstrommedia.com/id/sr3/92727abb-a144-4154-a1df-d19fd745f370.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Not for me.",
            "body": "I ordered this top to wear with my white golf skirt, for practice etc. Even in a size XS, it was way too big. Also, I did not like the sleeves or the fabric. Sent it back!",
            "date": "July 22, 2020"
        },
        {
            "heading": "Best T-Shirt Ever!",
            "body": "Love, love, love this T-shirt!!!! Please make it in White!!!!",
            "date": "July 21, 2020"
        },
        {
            "heading": "Sleeves way too big",
            "body": "This shirt runs very big. And the sleeves are huge. Not too long, just way too wide. Did not like. Returned.",
            "date": "July 19, 2020"
        },
        {
            "heading": "Very nice casual T - hoping for more colors",
            "body": "I just bought 2 of these Zella Ts, green agave and aurora blue, and am very pleased. Very nice material which washes well, comfortable, and a more relaxed fit than many of Zella's Ts but also flattering. Most of the Zella Ts I've tried before are such a slim cut that I need a L and they can still be a bit 'clingy' which is not my preference for casual workout tops. This one was perfect in a M. They seem a bit expensive at $45, but I'd still a buy some other colors IF they were available.",
            "date": "July 16, 2020"
        },
        {
            "heading": "okay",
            "body": "This T-shirt is well made and of quality material, however, it is just a tshirt not worth the price. Fit is good length is good price outrageous.",
            "date": "July 16, 2020"
        },
        {
            "heading": "Over sized and underwhelming",
            "body": "Way too large in a medium and completely see through in white. I will return.",
            "date": "July 9, 2020"
        },
        {
            "heading": "Great casual Tee",
            "body": "Great tee Love Zella ! These tees are quite comfortable also Stylish and well made , great quality love all the colors True to size Wash great on cold delicate cycle . Thanks Judy",
            "date": "July 7, 2020"
        },
        {
            "heading": "Perfect Athletic Tee",
            "body": "This is the perfect tee for working out, walking, or casual wear. I have almost every color and want more colors-bright yellow, cobalt blue, dark purple, please. I would say it runs slightly large. I ordered 2 sizes and kept the smaller size. The shirt is a poly/lyocell/spandex blend, but feels so soft, like cotton. It’s so comfortable to wear and has a little bit of stretch. The length, sleeves, and V- neck are perfect. Please continue making this shirt exactly the way it is, but with more color options.",
            "date": "July 7, 2020"
        },
        {
            "heading": "Zella Ava T-Shirt",
            "body": "This top is sooo soft and comfortable. I had to purchase two of the T-shirts. If there were more colors available would order an additional one. Goes well with my Zella pants!",
            "date": "July 4, 2020"
        },
        {
            "heading": "good",
            "body": "Loose with good drape. Green is as pictured. Largish so go smaller if in between sizes.",
            "date": "June 27, 2020"
        }
    ]
},
{
    "id": 13,
    "title": "Pretty Lace Ribbed Crop Top",
    "details": [
        "A rib-knit crop top features lace trimming the V-neck as a romantic focal point.",
        "17 1/2\" length (size TS-8)",
        "V-neck",
        "Short sleeves",
        "50% cotton, 50% polyester",
        "Machine wash, dry flat",
        "Imported",
        "Item #6012462"
    ],
    "rating_div": {
        "5": 50,
        "4": 40,
        "3": 5,
        "2": 0,
        "1": 5
    },
    "image": "https://n.nordstrommedia.com/id/sr3/b485eff6-e17c-408c-91b6-21b271737a72.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Cute top but small",
            "body": "I have a hard time with top shop sizing I have large implants and this top was way too small",
            "date": "July 16, 2020"
        },
        {
            "heading": "Cute but not baby blue",
            "body": "Bought the light blue color, but in person it was more like a seafoam blue green. Still cute.",
            "date": "July 14, 2020"
        },
        {
            "heading": "Cute and Simple",
            "body": "Bought this in size medium and color white. It was not as transparent as I thought it would be. I just loved how the lace detail and little bow added a charm to the top. I recommend wearing this with boyfriend/mom jeans and some comfortable sneakers.",
            "date": "July 10, 2020"
        },
        {
            "heading": "Fun trendy crop tops",
            "body": "Looks and fits as expected! Not sure I'd spend a ton of money on a top like this but the sale price was great. Comfy, lightweight and fun to wear with high-waisted shorts/jeans.",
            "date": "July 8, 2020"
        },
        {
            "heading": "Pretty but slightly transparent",
            "body": "This is very pretty slightly short and slightly transparent. I can see the bra lines",
            "date": "July 5, 2020"
        },
        {
            "heading": "very cropped",
            "body": "Cute top but too shortfor my 5'4\" frame. Ordered black and white and gave them to my daughter (she's only 5')",
            "date": "July 5, 2020"
        },
        {
            "heading": "order one size up",
            "body": "I usually wear size 4 in Topshop, I ordered 6, it fits perfectly! Cute!",
            "date": "June 25, 2020"
        },
        {
            "heading": "cute top for Teen",
            "body": "Got this for my daughter who wears a 0 or XS-S in Women. Got a size 2 and it fit perfectly. She liked it, hit just at top of high waist jeans and shows just a hint of belly with leggings.",
            "date": "June 19, 2020"
        },
        {
            "heading": "Comfortable and cute",
            "body": "This piece is flattering. It fits well and very comfortable. Also ordered two more in other colors.",
            "date": "June 15, 2020"
        },
        {
            "heading": "Comfortable",
            "body": "Nice casual t-shirt. Not dressy but you can dress it up. It’s an everyday shirt. It washed well didn’t shrink.",
            "date": "June 5, 2020"
        }
    ]
},
{
    "id": 14,
    "title": "Shirttail Tunic",
    "details": [
        "A comfy cotton-blend knit and casual drape mean you may never want to take this tunic off, but fortunately there's (at least) one for every day of the week.",
        "27 1/2\" front length; 30 1/2\" back length (size Medium)",
        "V-neck",
        "Long sleeves",
        "Shirttail hem",
        "62% cotton, 38% polyester",
        "Machine wash, tumble dry",
        "Imported",
        "Point of View and Petite Focus",
        "Item #5709546"
    ],
    "rating_div": {
        "5": 31,
        "4": 15,
        "3": 27,
        "2": 19,
        "1": 8
    },
    "image": "https://n.nordstrommedia.com/id/sr3/25375538-1ccc-4ff9-80b1-b3faefd6798e.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Beware of the yellow color!!",
            "body": "I was so excited to get this top in yellow, but when it arrived, I didn't even take it out of its plastic wrapping to try it on. Online the color is a happy sunny yellow. In reality the color is a drab mustard. It might look good on a redhead, not on me. Wish it came in a darker pink, red, blue . . . My bad for not reading through reviews before ordering. Thanks for your easy free shipping and returns, Nordy!",
            "date": "July 20, 2020"
        },
        {
            "heading": "Perfect shirt for cool weather",
            "body": "I wish this shirt was available in all colors in my size. It's perfect the perfect length to wear with leggings and will be great for the upcoming cooler weather. Size down if you're in between sizes as this shirt seems to run slightly large.",
            "date": "Sept 23, 2019"
        },
        {
            "heading": "Too scratcy!",
            "body": "Returned it as it was too scratchy!",
            "date": "Sept 17, 2019"
        },
        {
            "heading": "Not for me so much",
            "body": "I didn’t love this so much. I felt the style fit me weirdly across the shoulders, and I was hoping for a brighter yellow instead of a more mustardy color. It went back.",
            "date": "Aug 19, 2019"
        },
        {
            "heading": "Great lomg sleeve tunic trr",
            "body": "Great basic long sleeve top for cooler weather. I am curvy with a bigger bottom and this top size large fits me beautifully with leggings. Shows my shape while still being modest and covering my butt. I love that it is cotton and poly blend, it will hold up well through the years. Great find! Would not have bought this online but saw it in store and got it. I hope the pink comes back in stock!",
            "date": "Aug 9, 2019"
        },
        {
            "heading": "Disappointed",
            "body": "Definitely oversized, even when sized down, and fabric wasn't very soft. I returned it.",
            "date": "Aug 6, 2019"
        },
        {
            "heading": "Great shape and drape!",
            "body": "It would have given it more stars - but it's very sheer in white.",
            "date": "Aug 3, 2019"
        },
        {
            "heading": "Too Big to Flatter",
            "body": "Cute, but runs too large. Wanted to exchange, but there were none left.",
            "date": "July 31, 2019"
        },
        {
            "heading": "Long sleeve T-Shirt",
            "body": "The shirt is as expected, will wear a lot as it's a basic shirt. Perhaps a bit more casual than I though, a little thicker of t-shirt material.",
            "date": "July 30, 2019"
        },
        {
            "heading": "Shirttail Tunic",
            "body": "Great fit. Colour as expected. Looking forward to wearing it this fall.",
            "date": "July 30, 2019"
        }
    ]
},
{
    "id": 15,
    "title": "Clarity Tee",
    "details": [
        "Slouchy styling and a slubbed knit make this tee an essential element of your off-duty uniform.",
        "27\" length (size Medium)",
        "Crewneck",
        "Short sleeves",
        "60% cotton, 40% polyester",
        "Machine wash, tumble dry",
        "Imported",
        "t.b.d.",
        "Item #5930459"
    ],
    "rating_div": {
        "5": 59,
        "4": 15,
        "3": 15,
        "2": 9,
        "1": 3
    },
    "image": "https://n.nordstrommedia.com/id/sr3/9012d6ea-c4b8-48d9-985f-83562a48c050.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "Awesome t shirt!",
            "body": "What I love about the T-shirt is that it is thin cotton, yet very well-made. It’s very good quality and I like that it’s a little bit loose so very comfortable for the hot summer days. Overall I’ve already bought four of these and will continue to buy more as new colors come out. Love, love!",
            "date": "July 21, 2020"
        },
        {
            "heading": "My favorite go-to tee!",
            "body": "Love this soft, roomy comfy top! Great length & hides my stomach & hips. I have it in 5 colors.",
            "date": "July 18, 2020"
        },
        {
            "heading": "Not recommended",
            "body": "I would not recommend this tee at all. I have a few Free People tees and they are well made. This tee was very thin and looked cheap. I returned it.",
            "date": "July 15, 2020"
        },
        {
            "heading": "so disappointed",
            "body": "I LOVE free people t shirts. They’re pretty much all that I buy, but I washed it one time after wearing it for like 7 hours and it already has 2 holes in it in the stomach!",
            "date": "July 11, 2020"
        },
        {
            "heading": "Forgiving fit",
            "body": "I can usually size down one size in Free People. This is definitely an oversized t-shirt. I am only 5' 4\" so I need to tuck in part of it in the front of my jeans to give it some shape on me but it is a forgiving shape. I tend to carry my weight on my front and so it hides that but gives me some style while being casual. I will pair it with a jean jacket in the cooler weather. I love Free People because it can be work by a wide age group.",
            "date": "June 15, 2020"
        },
        {
            "heading": "great beach tee",
            "body": "I wish there were more of these available. It’s my go to beach shirt this summer and I’d love to purchase more of them.",
            "date": "June 12, 2020"
        },
        {
            "heading": "my new GO TO tee",
            "body": "Super soft, lightweight and comfy! It’s my new “go to” tee..",
            "date": "May 27, 2020"
        },
        {
            "heading": "Big, baggy tee",
            "body": "Fabric is too thin, it’s shapeless, I may return it",
            "date": "May 25, 2020"
        },
        {
            "heading": "Ladie's Top",
            "body": "I loved the yellow color and the fit-loose and easy. The fabric was too see through.",
            "date": "May 25, 2020"
        },
        {
            "heading": "these T shorts are so good",
            "body": "I like this T shirt and will wear it in Warner summer.",
            "date": "May 18, 2020"
        }
    ]
},
{
    "id": 16,
    "title": "Rainbow Knit Top",
    "details": [
        "Textured yarns in color-blocked hues liven up this comfy knit top that brightens your everyday look.",
        "Crewneck",
        "Long sleeves",
        "100% cotton with 74% cotton, 22% polyester, 4% elastane contrast",
        "Machine wash, dry flat",
        "Imported",
        "t.b.d.",
        "Item #6078969_1"
    ],
    "rating_div": {},
    "image": "https://n.nordstrommedia.com/id/sr3/c67cf35e-28a7-4577-9ebd-b7d063f8bd2f.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 17,
    "title": "KISS Spirit of '76 Crop Graphic Tee",
    "details": [
        "This cropped tee inspired by the Spirit of '76 tour is perfect for anyone named Beth (or any KISS fans, really).",
        "20\" length (size Medium)",
        "100% cotton",
        "Machine wash, tumble dry",
        "Imported",
        "BP.",
        "Item #6057193"
    ],
    "rating_div": {
        "5": 100,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
    },
    "image": "https://n.nordstrommedia.com/id/sr3/56a192d2-fa54-4a9d-ad77-ae22f9b1e284.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 18,
    "title": "Horoscope Graphic Tee",
    "details": [
        "It's a sign that you should be wearing this horoscope-themed tee destined to fit you perfectly.",
        "20 1/2\" length (size 8)",
        "Crewneck",
        "Short sleeves",
        "100% cotton",
        "Machine wash, dry flat",
        "Imported",
        "Item #6087447"
    ],
    "rating_div": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 100
    },
    "image": "https://n.nordstrommedia.com/id/sr3/6a8066f0-c7ad-4ab6-926b-5523bc419cfb.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 19,
    "title": "Short Sleeve Crewneck Tee",
    "details": [
        "A collect-every-color staple for spring, this crewneck tee feels wonderful in a jersey knit of soft cotton and modal.",
        "27\" regular length (size Medium); 26\" petite length (size Medium P).",
        "Crewneck.",
        "Short sleeves.",
        "50% pima cotton, 50% modal.",
        "Machine wash cold, tumble dry low.",
        "By Halogen; imported.",
        "Point of View and Petite Focus.",
        "Item #1174529"
    ],
    "rating_div": {
        "5": 63,
        "4": 21,
        "3": 10,
        "2": 5,
        "1": 1
    },
    "image": "https://n.nordstrommedia.com/id/sr3/4c23c95c-fa86-4017-8f42-755731a19750.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": [
        {
            "heading": "tight",
            "body": "Great quality but runs tight. I’m 5’8 with 38 DD chest and I had to go up to a xxl.",
            "date": "July 17, 2020"
        },
        {
            "heading": "Runs small!",
            "body": "Unlike other items that run large, this item runs particularly small, but a size up.",
            "date": "July 14, 2020"
        },
        {
            "heading": "Nice t-shirt",
            "body": "Exactly as pictured. A little thin but great for summer and casual wear. Plan to carry this into fall using to layer and dress up with scarves or jewelry. 5’5”, 150 lbs, apple shape, XL fit nicely.",
            "date": "July 10, 2020"
        },
        {
            "heading": "excellent choice",
            "body": "Love the t-shirt; soft and silky. High quality material.",
            "date": "July 10, 2020"
        },
        {
            "heading": "Very fitted tee",
            "body": "Great colors and a really close, unforgiving fit through the body if you like that style. I've gotten to an age where that is not so flattering, so I am returning these tees, and giving it 4-stars instead of 5. When I was younger and slimmer, I would have loved this very fitted look. Would work great tucked inside bottoms.",
            "date": "July 7, 2020"
        },
        {
            "heading": "Best Halogen!",
            "body": "I love Halogen Tshirts. I like the capped sleeves and the material, especially. My husband, long a consultant in the textile industry, told me that the cotton from Peru is some of the best!",
            "date": "July 5, 2020"
        },
        {
            "heading": "Nice color but...",
            "body": "Returned. Found the material too thin. Fairly clingy.. the red was a great color.",
            "date": "June 30, 2020"
        },
        {
            "heading": "Too sheer",
            "body": "Fit is absolutely perfect (5’8”, 160lb, size M) but the white was too sheer to wear without a tank underneath.",
            "date": "June 30, 2020"
        },
        {
            "heading": "Favorite Black T",
            "body": "I bought one of these about 3 years ago. It’s still my favorite so I bought a back-up and I’m probably going to order a 3rd. The fabric is wash & wear (I don’t put it in the dryer). The length is a bit longer than most t’s. That’s my favorite feature. Love love love it!",
            "date": "June 27, 2020"
        },
        {
            "heading": "Great white t-shirt",
            "body": "Nice white t-shirt that is NOT see thru. Soft. Washes well",
            "date": "June 22, 2020"
        }
    ]
},
{
    "id": 20,
    "title": "Los Angeles 1973 Graphic Lo-Fi Shrunken Tee",
    "details": [
        "Light and airy with a perfectly worn-in vibe, this vintage-y shrunken graphic tee takes you back to 1973 Los Angeles (and what could be better than that?).",
        "22\" length (size Medium)",
        "Crewneck",
        "Short sleeves",
        "100% cotton",
        "Machine wash, tumble dry",
        "Imported",
        "Item #6082904"
    ],
    "rating_div": {},
    "image": "https://n.nordstrommedia.com/id/sr3/183735db-b86f-4cf0-a098-cbab6631c54b.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 21,
    "title": "V-Neck Button Top",
    "details": [
        "Soft and summery, this easy waffle-knit top features versatile front buttons and a perfectly dipped neck.",
        "22\" length (size Medium)",
        "Button half-placket",
        "V-neck",
        "Short sleeves",
        "65% polyester, 28% rayon, 7% spandex",
        "Machine wash, dry flat",
        "Imported",
        "Item #6041318"
    ],
    "rating_div": {},
    "image": "https://n.nordstrommedia.com/id/sr3/79bda60c-296c-4596-867e-78f0951780b9.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 22,
    "title": "Side Cinch Shirt",
    "details": [
        "On-trend tie-dye updates a comfy-casual shirt that's cinched at the sides with drawstring ruching."
    ],
    "rating_div": {},
    "image": "https://n.nordstrommedia.com/id/sr3/17e244d9-e87c-4730-b18f-a602696d0721.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
},
{
    "id": 23,
    "title": "Knot Front Tee",
    "details": [
        "A knotted hem adds understated casual charm to this essential crewneck tee."
    ],
    "rating_div": {
        "5": 50,
        "4": 25,
        "3": 0,
        "2": 0,
        "1": 25
    },
    "image": "https://n.nordstrommedia.com/id/sr3/7b58f205-1acd-47a9-84b5-bb2636043c12.jpeg?crop=pad&pad_color=FFF&format=jpeg&w=780&h=780",
    "comments": []
}]